src/cf/Documents/ПогашениеКупонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПогашениеКупонов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.СобственныеЦБ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/СобственныеЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>СобственныеЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переоценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Затраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДПолученный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДНакопленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВыбытиеЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ФинансовыйРезультат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ФинансовыйРезультат</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/ПогашениеКупонов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Движения.СобственныеЦБ.Записывать = Истина;
	Движения.ФинансовыйРезультат.Записывать = Истина;
	Движения.СобственныеЦБ.Очистить();
	Движения.ФинансовыйРезультат.Очистить();

	ПровестиПогашение(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПровестиПогашение(Отказ)

	// 1. Запрос остатков
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СобственныеЦБОстатки.Партия КАК Партия,
	|	СобственныеЦБОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	СобственныеЦБОстатки.НКДНакопленныйОстаток КАК НКДНакопленныйОстаток,
	|	СобственныеЦБОстатки.НКДПолученныйОстаток КАК НКДПолученныйОстаток
	|ИЗ
	|	РегистрНакопления.СобственныеЦБ.Остатки(
	|		&МоментВремени,
	|		ЦеннаяБумага = &ЦеннаяБумага) КАК СобственныеЦБОстатки
	|ГДЕ
	|	СобственныеЦБОстатки.КоличествоОстаток > 0";

	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();

	Если ТаблицаОстатков.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Нет остатков ЦБ ""%1"" для погашения купонов.'"),
			Строка(ЦеннаяБумага));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// 2. Списание НКД по каждой партии
	ИтогоСуммаКупона = 0;

	Для Каждого СтрокаОстатков Из ТаблицаОстатков Цикл

		СуммаКПогашению = НКД * СтрокаОстатков.КоличествоОстаток;
		ДоступноНКД = СтрокаОстатков.НКДНакопленныйОстаток + СтрокаОстатков.НКДПолученныйОстаток;

		Если СуммаКПогашению > ДоступноНКД Тогда
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Недостаточно НКД для погашения по ЦБ ""%1"". Требуется: %2, доступно: %3.'"),
				Строка(ЦеннаяБумага),
				Формат(СуммаКПогашению, "ЧДЦ=2"),
				Формат(ДоступноНКД, "ЧДЦ=2"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		// Списываем сначала из НКДНакопленный, потом из НКДПолученный
		СписатьИзНакопленного = Мин(СтрокаОстатков.НКДНакопленныйОстаток, СуммаКПогашению);
		ОстатокКСписанию = СуммаКПогашению - СписатьИзНакопленного;
		СписатьИзПолученного = Мин(СтрокаОстатков.НКДПолученныйОстаток, ОстатокКСписанию);

		Если СписатьИзНакопленного = 0 И СписатьИзПолученного = 0 Тогда
			Продолжить;
		КонецЕсли;

		ИтогоСуммаКупона = ИтогоСуммаКупона + СуммаКПогашению;

		Движение = Движения.СобственныеЦБ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЦеннаяБумага = ЦеннаяБумага;
		Движение.Партия = СтрокаОстатков.Партия;
		Движение.Количество = 0;
		Движение.Стоимость = 0;
		Движение.Переоценка = 0;
		Движение.Затраты = 0;
		Движение.НКДНакопленный = СписатьИзНакопленного;
		Движение.НКДПолученный = СписатьИзПолученного;

	КонецЦикла;

	// 3. Финансовый результат
	Если ИтогоСуммаКупона > 0 Тогда
		Движение = Движения.ФинансовыйРезультат.Добавить();
		Движение.Период = Дата;
		Движение.ЦеннаяБумага = ЦеннаяБумага;
		Движение.Сумма = ИтогоСуммаКупона;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
